
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7697129967)



<pre><code>Apply complete! Resources: 2 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/686f94d5-a0cb-4571-b042-55f8e964bd0f/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_compute_network.internal-vpc-network will be created
  + resource "google_compute_network" "internal-vpc-network" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "int-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "gig-japan-398904"
      + routing_mode                              = "REGIONAL"
      + self_link                                 = (known after apply)
    }

  # google_compute_subnetwork.internal-vpc-subnet will be created
  + resource "google_compute_subnetwork" "internal-vpc-subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.5.5.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "int-vpc-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "gig-japan-398904"
      + purpose                    = (known after apply)
      + region                     = "asia-northeast1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
google_compute_network.internal-vpc-network: Creating...
google_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_artifact_registry_repository.artifact-repository: Modifications complete after 1s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_compute_network.internal-vpc-network: Still creating... [10s elapsed]
google_compute_network.internal-vpc-network: Creation complete after 11s [id=projects/gig-japan-398904/global/networks/int-vpc]
google_compute_subnetwork.internal-vpc-subnet: Creating...
google_compute_subnetwork.internal-vpc-subnet: Still creating... [10s elapsed]
google_compute_subnetwork.internal-vpc-subnet: Still creating... [20s elapsed]
google_compute_subnetwork.internal-vpc-subnet: Creation complete after 25s [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet]

Apply complete! Resources: 2 added, 1 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: google_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource "google_artifact_registry_repository" "artifact-repository" {%0A        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"%0A        name             = "ikigai"%0A        # (10 unchanged attributes hidden)%0A%0A      + docker_config {%0A          + immutable_tags = false%0A        }%0A    }%0A%0A  # google_compute_network.internal-vpc-network will be created%0A  + resource "google_compute_network" "internal-vpc-network" {%0A      + auto_create_subnetworks                   = false%0A      + delete_default_routes_on_create           = false%0A      + gateway_ipv4                              = (known after apply)%0A      + id                                        = (known after apply)%0A      + internal_ipv6_range                       = (known after apply)%0A      + mtu                                       = (known after apply)%0A      + name                                      = "int-vpc"%0A      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"%0A      + numeric_id                                = (known after apply)%0A      + project                                   = "gig-japan-398904"%0A      + routing_mode                              = "REGIONAL"%0A      + self_link                                 = (known after apply)%0A    }%0A%0A  # google_compute_subnetwork.internal-vpc-subnet will be created%0A  + resource "google_compute_subnetwork" "internal-vpc-subnet" {%0A      + creation_timestamp         = (known after apply)%0A      + external_ipv6_prefix       = (known after apply)%0A      + fingerprint                = (known after apply)%0A      + gateway_address            = (known after apply)%0A      + id                         = (known after apply)%0A      + internal_ipv6_prefix       = (known after apply)%0A      + ip_cidr_range              = "10.5.5.0/24"%0A      + ipv6_cidr_range            = (known after apply)%0A      + name                       = "int-vpc-subnet"%0A      + network                    = (known after apply)%0A      + private_ip_google_access   = true%0A      + private_ipv6_google_access = (known after apply)%0A      + project                    = "gig-japan-398904"%0A      + purpose                    = (known after apply)%0A      + region                     = "asia-northeast1"%0A      + secondary_ip_range         = (known after apply)%0A      + self_link                  = (known after apply)%0A      + stack_type                 = (known after apply)%0A    }%0A%0APlan: 2 to add, 1 to change, 0 to destroy.%0Agoogle_compute_network.internal-vpc-network: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 1s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_compute_network.internal-vpc-network: Still creating... [10s elapsed]%0Agoogle_compute_network.internal-vpc-network: Creation complete after 11s [id=projects/gig-japan-398904/global/networks/int-vpc]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Creating...%0Agoogle_compute_subnetwork.internal-vpc-subnet: Still creating... [10s elapsed]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Still creating... [20s elapsed]%0Agoogle_compute_subnetwork.internal-vpc-subnet: Creation complete after 25s [id=projects/gig-japan-398904/regions/asia-northeast1/subnetworks/int-vpc-subnet]%0A%0AApply complete! Resources: 2 added, 1 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":29,"Program":"tfcmt","SHA1":"100da38e9a5b1779e0c12def9ed376b589bf4e71","Vars":{},"WorkflowName":"iaac_apply"} -->